{"title":"《细节的力量：51件你必须知道的职场小事》书摘","date":"2019-09-29T01:20:41.000Z","link":"post/19-09-29-books","tags":["book"],"updated":"2019-10-07T13:11:29.235Z","content":"<p>细节的力量：51件你必须知道的职场小事 —— Flanagan裕美子</p>\n<p>◆ 03 失误 不怕麻烦，反复检查</p>\n<blockquote>\n<p>无论被训斥还是被批评，工作是不等人的。这时，我会反复对自己讲以下4点：<br>1．重新调整日程，分配好时间再开始工作。<br>2．制作“清单”，避免失误。<br>3．必须要做到“检查三次”。<br>4．即使失败也不要感到沮丧。</p>\n</blockquote>\n<blockquote>\n<p>在纸上罗列出自己在平时工作中容易出现的失误。利用清单，筛选出自己遗漏的问题或是重复犯的错误，等等。虽然我们想要尽量避免犯错，但很多时候很难做到这一点。这时，我们就要利用清单，消灭错误。</p>\n</blockquote>\n<p>◆ 06 预先准备 通勤时间也是当天工作的准备时间</p>\n<blockquote>\n<p>关于如何利用上下班的通勤时间这件事，做到上班和下班时间做180°相反的事是最为理想的。下班就是放松的时间，放松自己工作中紧绷了一天的神经，做一些自己喜欢的事。<br>但是，上班则是一天工作的开始，是非常重要的准备时间。是否能够充分利用这个时间，会对当天的“工作效率”带来很大影响。</p>\n</blockquote>\n<p>◆ 07 惯性思维 工作状况瞬息万变，要抛掉“思维定势”</p>\n<blockquote>\n<p>无论这个人多厉害，他提供的信息也不一定都是正确的。正因为如此，在任何情况下都要做到“亲自确认信息”，自己对自己负责。亲自确认信息并不是不相信别人、质疑别人。而是心怀感激地接受别人带来的信息，在这个基础上“为了自保，才要自己去确认”。<br>每天都要完成的工作其实并不是完全一成不变的。因此，要把每天的每一项工作当成“新的项目”来对待，无论多麻烦都要自己亲自确认。无论多么有自信也不要“过度自信”，要认真地调查所有相关信息。</p>\n</blockquote>\n<p>◆ 09 保存记录 使用一切手段保留记录，关键时刻可以“保身”</p>\n<blockquote>\n<p>无论任何事情都要做好记录，这样可以减少工作中出现的问题，节约时间。</p>\n</blockquote>\n<p>◆ 10 避免疏忽 再小的工作也要当成重要的事去做</p>\n<blockquote>\n<p>越是工作出色的人，也越是会注意细节。他们总是秉持着“交给自己的工作没有优劣之分”的原则，认真完成每项工作。因为他们知道，没有什么工作是不重要的，低估工作的重要性一定会给自己带来大麻烦。</p>\n</blockquote>\n<blockquote>\n<p>工作上的事不分大小，只有紧急程度的区别，但是所有事都很重要。忘记了这个道理，就有可能吃大亏。为了避免发生不可挽回的错误，请认真对待每一个日常工作。工作有缓急，但没有轻重。</p>\n</blockquote>\n<p>◆ 06 表达 抛掉“对方应该能明白”的“想当然”</p>\n<blockquote>\n<p>最危险的就是想当然地认为“别人都应该知道”。每个人都有各自的思维方式，就像一千个读者的眼中有一千个哈姆雷特。因此，认为别人能读懂自己的心思，就想当然地不去表达和诉说，这种想法是非常危险的。<br>当你感到“每个人都不能理解自己”时，其实是你自己没让大家明白你的想法而已。<br>工作的顺利从良好的沟通开始。从此时此刻开始，无论是大事还是小事，请牢记“不表达，就无法传达”这句话，认真和他人沟通。即使觉得对方已经理解自己的想法，也还是要再次确认。<br>如果有了好的想法，即便可能会被否定，也还是要说出来。即使认为自己可以理解对方的想法，也要再询问并确认对方的看法。<br>刚开始不太顺利也没关系，只要有意识地主动沟通，相信一定会提高自己的沟通能力。</p>\n</blockquote>\n<p>◆ 09 理论武装 用“事实依据”和“理论依据”说服上司</p>\n<blockquote>\n<p>“据说是这样？你调查过没有？有没有数据资料？”<br>从自己身上经手的任何事情，都需要去做一定的引据，因为你经手的事你说的话都是在用你的信用背书。</p>\n</blockquote>\n<p>◆ 06 预防错误 制作待办事项清单，逐个解决</p>\n<blockquote>\n<p>这是因为将需要完成的工作记在笔记上，大脑便可以专注思考其他事情。当脑中闪过好的想法或应做的工作时，就会忽略手边正在做的事情。这是因为当时你的注意力都集中在“一定要牢记这件事”上。将“一定要牢记的事情”记录在纸上或是电脑上，就能够专注于现在正在处理的工作。</p>\n</blockquote>\n<p>◆ 09 积累经验 越是复杂的工作，就越要谨慎</p>\n<blockquote>\n<p>人们通常会下意识地想要逃避麻烦和困难的事。但是一旦完成了这些事，从中获得的经验就会变为自己的财富。如果有机会，一定要勇于挑战这些难题。当你成功后，获得的自信心绝对会给自己的事业和人生带来好的影响。</p>\n</blockquote>\n<p>◆ 4 问题就是机会，迅速解决问题</p>\n<blockquote>\n<p>你只要经历一次挫折，并将其恢复到原本应有的状态，自然就会积累不少经验。因此，我们不要逃避问题，应该尝试解决困难。这种经历绝不是坏事。问题和危机其实是提升他人对你的工作评价和能力评价的机会。</p>\n</blockquote>\n<p>◆ 03 为对方考虑 在解决问题时要照顾“对方的感情”</p>\n<blockquote>\n<p>如果出现失误后的解决步骤<br>1．向对方道歉后，要详细说明准备如何、用多长时间来挽救失误。<br>2．开始采取行动后，依然要用邮件或电话紧密地汇报进度。<br>3．得到最终的结果后，确认对方的态度，并再次道歉。</p>\n</blockquote>\n<p>◆ 05 失败后 分析失败原因，迎接下一次的成功</p>\n<blockquote>\n<p>任何人都会或多或少地犯一些错误。但是对待失败的态度则会影响自己今后的发展。</p>\n</blockquote>\n<blockquote>\n<p>“允许自己继续犯错就是愚蠢，从失败中获得新知识才是明智的做法。”</p>\n</blockquote>\n<blockquote>\n<p>能否将失误转变为“成长的契机”，主要取决于自身如何调整心态。</p>\n</blockquote>\n<p>◆ 06 慌乱 锻炼自己沉着应对突发事件的能力</p>\n<blockquote>\n<p>“意料之外”对于任何立场的人来说都不算是一个好的借口。作为一名职场人士，平时要考虑到种种风险，将“意料之外”归到“预料之中”。<br>但是，万一出现了失误，在因恐慌而造成更多的失误之前，我们要有意识地斩断这种“失误的连锁反应”。</p>\n</blockquote>\n<blockquote>\n<p>“意料之外”对于任何立场的人来说都不算是一个好的借口。作为一名职场人士，平时要考虑到种种风险，将“意料之外”归到“预料之中”。<br>但是，万一出现了失误，在因恐慌而造成更多的失误之前，我们要有意识地斩断这种“失误的连锁反应”。<br>很多时候人们喜欢用这样的心理暗示（意料之外）或者接口来作为自己的免责声明降低自己需要为这次的”考虑不周”所需要承担的责任。但大部分时候的”意料之外”并不是真的完全没有可能想到的，只是你一开始就没有去考虑过这些意外情况，或者觉得为这些可能的意外情况花费太多的时间精力而懒得付出这些精力而导致的。</p>\n</blockquote>\n<p>◆ 5 掌握良好的思维方法，提高自身水平</p>\n<blockquote>\n<p>目光坚定地注视对方时，进一步试探对方，说出自己更高的期待后，很可能会得到意想不到的结果。即便是自己觉得对方不可能答应，也不妨说出来看看。遭到拒绝也没关系，反正自己也已经做好被拒绝的准备，最多说一句“果然如此，但是我也不后悔”。如果对方答应了自己的请求，就自然是再好不过了，“太好了！幸好鼓起勇气说出来了！”<br>不管结果如何，不说出来就无法获得结果，这才是谈判的乐趣。既然要谈判，就不妨愉快地挑战新的高度。</p>\n</blockquote>\n<p>◆ 02 工作姿态 不要否定新想法</p>\n<blockquote>\n<p>以否定新创意来作为安全对策并不难，但这样也无法获得新的发现。</p>\n</blockquote>\n<p>◆ 06 朋友 和“不同”的人在一起反而能拓展思维</p>\n<blockquote>\n<p>你和同部门、从事类似工作的人在一起确实会觉得很稳定、很舒服，但是长此以往，你们的思维方式或方向就会趋于相同。这样就会导致自己无法接触到新的事物和想法，工作氛围也固定了，产生新创意的可能性就会下降。</p>\n</blockquote>\n<p>◆ 08 调动·转岗 逃避工作困难的人会在新岗位上遭遇两倍或三倍的困难</p>\n<blockquote>\n<p>逃跑之前，用尽全力尝试解决问题。这种积极的态度会让你更上一个层次。</p>\n</blockquote>\n","prev":{"title":"周记(2019-9-23 —— 2019-10-07)","link":"post/19-9-23-wenkend"},"next":{"title":"周记(2019-9-16 —— 2019-9-22)","link":"post/2019-9-22-notes"},"plink":"https://yanoo1497.github.io/post/19-09-29-books/"}