{"title":"《小狗钱钱》——博多·舍费尔 书摘","date":"2019-10-07T07:20:41.000Z","link":"post/19-10-07-money","tags":["book"],"updated":"2021-10-10T23:38:37.823Z","content":"<p>小狗钱钱</p>\n<p>◆ 前言</p>\n<blockquote>\n<p>我起初有些担心，人们在读故事时，不是努力去挖掘故事情节之后隐藏的生活原则，而是试图模仿书中主人公获取成功的举动。成功的故事很少有精彩的翻版，但是故事中包含的道理却可以帮助我们在遭遇困境时找到最佳的出路。同样，当我发现读者开始崇拜作者本人，而没有掌握书中叙述的古老真理时，我也有些不安。个人的经历是很难效仿的，但最基本的真理却完全可以复制。</p>\n</blockquote>\n<p>在听或者看一个成功故事的时候要多去研究这些成功背后的规律而不是仅仅只是表面的效仿。</p>\n<blockquote>\n<p>我们常常会过于迅速地得出结论：“这我已经知道了。”似乎认识几个关键词就足够了。这种想法很可能是一个陷阱，因为当我们发现对要学的东西早已熟悉时，可能就不会继续学习下去。因为我们觉得自己已经知道了，所以就对这些信息不再感兴趣。</p>\n</blockquote>\n<p>这个概念在《跃迁》里面也提到过，有很多人并不是没有学习而是“学”的太快太多了，“学习会有瞬间理解的快感，而练习却反复暴露自己的智商。其实后者才是成长之路”。大多数人都在匆匆一瞥之后，并给予自己已经学到了心理暗示从而忽视了后续的实践出真知之理。</p>\n<blockquote>\n<p>“并非困难使我们放弃，而是因为我们放弃，才显得如此困难。”</p>\n</blockquote>\n<p>◆ 第一章 白色的拉布拉多犬</p>\n<blockquote>\n<p>我也不认为钱是人一生中最重要的东西。可是假如我们缺钱的话，钱就会变得格外重要。</p>\n</blockquote>\n<p>和所有的物以稀为贵一样，当一样东西稀缺的时候它就会显得格外重要。类比到其他方面，我们需要格外注意平衡自己生活的各方面，否则我们将会因为某个因素的稀缺而支付超出它市场价格的“代价”。</p>\n<p>◆ 第二章 梦想储蓄罐和梦想相册</p>\n<blockquote>\n<p>如果你只是抱着试试看的心态，那么你只会以失败告终，你会一事无成。‘尝试’纯粹是一种借口，你还没有做，就已经给自己想好了退路。不能试验，你只有两个选择——做或者不做。</p>\n</blockquote>\n<p>这段话非常印象深刻了，做一件事最开始的想法意志很多时候决定了你会为它付出的努力程度，当一个人相信一件事的时候才会愿意为它付出更多。同样的概念在《拆掉思维里的墙》也提到过——“一旦人们意识到一件事情是可能，那么接下来的事情就只是技术和时间问题了”。所以很多时候，思维方式决定我们能否做成做好一件事。</p>\n<blockquote>\n<p>“学习就是认识新观念和新想法的过程。假如人们始终以同一种思维方式来考虑问题的话，那么始终只会得到同样的结果。因为我对你讲述的许多内容是你以前从未接触过的，所以我建议你，在你还没有做之前，不要轻易下结论。没有想象力的人是很难成就大事的。我们对一件事投入的精力越多，成功的可能性也越大。可是大多数人把精力放在自己并不喜欢的事情上，而不去想象自己希望得到的东西。”</p>\n</blockquote>\n<blockquote>\n<p>有一只海鸥曾经对我说过：‘在你展翅飞翔之前，你就必须相信自己能到达目的地。’你必须设想自己已经拥有了这些东西，这样你的一个小愿望才会变成一种强烈的渴望。你想象得越多，你的愿望就越强烈，那么你就会开始寻找机会来实现自己的梦想。吉娅，机会到处都是，但是只有在你寻找它的时候，你才能看见它。只有当你心中有了强烈的渴望，你才会去寻觅机会。而当你想象的时候，强烈的渴望就产生了。”</p>\n</blockquote>\n<p>◆ 第三章 达瑞，一个很会挣钱的男孩</p>\n<blockquote>\n<p>“你的自信程度决定了你是否相信自己的能力，是否相信你自己。假如你根本不相信你能做到的话，那么你就根本不会动手去做，而假如你不开始去做，那么你就什么也得不到。”</p>\n</blockquote>\n<blockquote>\n<p>关于赚钱的法则：第一，为别人解决一个难题，那么你就能赚到许多钱；第二，把精力集中在你知道的、能做的和拥有的东西上。</p>\n</blockquote>\n<p>◆ 第五章 钱钱以前的主人</p>\n<blockquote>\n<p>在遇到困难的时候，仍然要坚持自己的想法。一切正常的时候，每个人都能做到这一点。只有当真正的困难出现时才能见分晓。只有少数人能坚定不移地贯彻自己的计划。那些非常成功的人，甚至有能力在他们最困难的时候作出最杰出的表现。情况顺利的时候，人人都能挣到钱。只有在逆境中，一切才能见分晓。</p>\n</blockquote>\n<blockquote>\n<p>当你决定做一件事情的时候，你必须在72小时之内完成，否则你很可能永远不会再做了。</p>\n</blockquote>\n<p>◆ 第六章 爸爸妈妈犯下的错误</p>\n<blockquote>\n<p>1．毁掉信用卡。2．在许可范围内按最低的分期付款数目标准支付。<br>3．将扣除生活费后剩下的钱的一半存起来，剩下的一半用于支付消费贷款。最好根本不申请消费贷款。<br>4．消费之前问自己，这真的有必要吗？</p>\n</blockquote>\n<p>◆ 第十一章 爸爸妈妈不明白</p>\n<blockquote>\n<p>“幸运其实只是充分准备加上努力工作的结果。”</p>\n</blockquote>\n<p>◆ 第十三章 巨大的危机</p>\n<blockquote>\n<p>“当你写成功日记的时候，你会对自己，对世界，还有对成功的规律作更深入的思考，会越来越多地了解自己和自己的愿望，这样你才会有能力去理解别人。彻底了解自己和世界上的所有秘密，是我们无法完全实现的一种理想，但我们可以一步一步地慢慢接近这种理想。”</p>\n</blockquote>\n","prev":{"title":"周记(2019-10-7 —— 2019-10-13)","link":"post/weekly"},"next":{"title":"周记(2019-9-23 —— 2019-10-07)","link":"post/19-9-23-wenkend"},"plink":"https://yanoo1497.github.io/post/19-10-07-money/"}