{"title":"How I Learn Things Online (Way More Efficiently)——English Learning Weekly","date":"2019-08-31T13:46:15.000Z","link":"post/post","tags":["weekly"],"categories":["weekly"],"updated":"2019-09-01T13:47:45.207Z","content":"<blockquote>\n<p>Video Link: <a href=\"https://www.youtube.com/watch?v=rVmMbMa3ncI&feature=youtu.be\" target=\"_blank\" rel=\"noopener\">How I Learn Things Online (Way More Efficiently)</a></p>\n</blockquote>\n<h3 id=\"Context\">Context<a href=\"post/post#Context\"></a></h3><h4 id=\"Stage-one\">Stage one<a href=\"post/post#Stage-one\"></a></h4><p>Cast a wide net and learn as much as you can about the field that you’re geting into.</p>\n<h4 id=\"Stage-two\">Stage two<a href=\"post/post#Stage-two\"></a></h4><p>Go strait to the top.This is a very effective method to distinguishing hight quality from low informations.</p>\n<h4 id=\"Stage-three\">Stage three<a href=\"post/post#Stage-three\"></a></h4><p>Apply what you are learning.</p>\n<h3 id=\"Vocabulary\">Vocabulary<a href=\"post/post#Vocabulary\"></a></h3><ul>\n<li>timestamps: a record in printed or digital form that shows the time at which something happened or was done</li>\n<li>sift : to make a close examination of all the parts of something in order to find something or to separate what is useful from what is no<blockquote>\n<p>You have to learn how to sift through the dirt to find the gold.</p>\n</blockquote>\n</li>\n<li>convince : v. persuade someone or make someone certain</li>\n<li>discipline : n. a particular area of study, esp. the ability to control a mental activity. v. to punish someone<blockquote>\n<p>The good news is that discipline is like a muscle which means it’s something that you do about it.</p>\n</blockquote>\n</li>\n<li>strive: to try very hard to do something or to make something happen, especially for a long time or against difficulties</li>\n<li>crucial : extremely important or necessary</li>\n<li>clueless adj:having no knowledge of something, or of things in general</li>\n<li>incompetence : lack of ability to do something successfully or as it should be done</li>\n<li>unconscious : the part of your mind that contains feelings and thoughts that you do not know about, and that influences the way you behave</li>\n<li>absorption</li>\n<li>disciple : a person who believes in the ideas and principles of someone famous and tries to live the way that person does or did子</li>\n<li>evident : easily seen or understood</li>\n<li>bombard : to attack a place with continuous shooting or bombs</li>\n<li>negotiator : someone who tries to help two groups who disagree to reach an agreement with each other, usually as a job</li>\n<li>legitimate ：1.reasonable and acceptable 2.allowed by law</li>\n<li>portfolio ： n. a collection of drawings, designs, or other papers that represent a person’s work.</li>\n</ul>\n","prev":{"title":"关于 typescript 学习手记（一）基本类型","link":"post/ts"},"next":{"title":"(How to Think in English to Improve Your English Speaking Skills)——English Learning Weekly","link":"post/weekly-English-8-18"},"plink":"https://yanoo1497.github.io/post/post/"}