{"title":"《跃迁》—— 古典 书摘","date":"2019-09-22T01:20:41.000Z","link":"post/2019-9-22-yueqian","tags":["book"],"updated":"2021-10-10T15:48:40.564Z","content":"<blockquote>\n<p>这里的书摘是微信读书过程中顺手摘录的一些读书笔记，在这里做一些分享，也给计划看这本书的人一些内容参考。</p>\n</blockquote>\n<h2 id=\"走在时代前面的明白人\">走在时代前面的明白人<a href=\"post/2019-9-22-yueqian#走在时代前面的明白人\"></a></h2><p>知道知识在哪儿，比知道知识是什么更重要</p>\n<h2 id=\"外包大脑，成为超人\">外包大脑，成为超人<a href=\"post/2019-9-22-yueqian#外包大脑，成为超人\"></a></h2><p>大脑不该用来记忆，而是要用来观察、思考、创造和影响他人。这本书谈到的，就是这些在新时代高手必备的认知、一定要理解的社会规律，以及必须掌握的技能。</p>\n<h2 id=\"头部效应：站位比努力更重要\">头部效应：站位比努力更重要<a href=\"post/2019-9-22-yueqian#头部效应：站位比努力更重要\"></a></h2><p>一个距离你太远的领域，你根本就看不到真实的信息和对手，听到的全是传说、段子或者别人希望你听到的东西。这些信息只能当故事听，根本没法拿来实际操作，你很难从中收获什么有用的信息。</p>\n<h2 id=\"功利学习法：学得更好，却学得更少\">功利学习法：学得更好，却学得更少<a href=\"post/2019-9-22-yueqian#功利学习法：学得更好，却学得更少\"></a></h2><p>一张银行卡，你存进去再多，如果不知道提取密码，就没法提现；知识也是一样。知识晶体就是知识的提取密码。大部分人学了很多，却因为不知道这个概念，没法提现，非常可惜。反过来说，有很多人学习上投入不大，只是特别擅长整理和结晶，也就是能从众多散乱的知识里拿出不错的产品。知识晶体是整个学习中最关键的一环。</p>\n<h2 id=\"联机学习者：成为知识的路由器\">联机学习者：成为知识的路由器<a href=\"post/2019-9-22-yueqian#联机学习者：成为知识的路由器\"></a></h2><p>过去自己学自己悟，才是真本事。<strong>信息爆炸时代，“调用”和“整合”他人的答案，显然更加重要。</strong></p>\n<p>过去一定要自己完全学通了，大彻大悟了才出来教别人。100分教5分的人，老师站着讲，学生“跪”着听；信息时代，往往是一个15分的人教5分的人，大家商量着来，偶尔学生还能教老师几招。</p>\n<p>在传授稳定的、系统化的知识层面，前者更优；但是在学习最新的，还未有人整理过的知识方面，后者显然更快。</p>\n<p>这就是三种学习思路。<br><strong>• 自学：自己找答案；<br>• 联机学习：和同行交流，用答案换答案；<br>• 跨界联机学习：跨行学习交流，用答案换答案。</strong></p>\n<p>你是哪一种思路？可以看看自己遇到问题时的第一反应：<br>• 遇到问题，苦思：“这可怎么办？”想一晚上不得；<br>• 遇到问题，找书：“哪里有答案？”开始通过网络、书来找资料；<br>• 遇到问题，找人：“谁最有可能知道这个答案？在这之前我<br>要准备些什么？”然后准备沟通，提出高质量的问题。</p>\n<p>联机社交学习才是最快的学习方式。人类历史上三次最著名的知识大爆炸，都是跨界联机学习的直接成果。</p>\n<p>如果说生物通过基因进化，那么人类社会则通过文化基因进化。他创造了一个词来对应生物基因（gene），即文化基因（memes，模因）。<br>今天，最新的知识的源头并不在某个教授的脑子里或一本教科书的某一页，它们在大脑和大脑的碰撞中，在问题和知识的交汇之处，在一线高手的实战之中。<br>要和知识源头联机。</p>\n<p><strong>今天，最新的知识的源头并不在某个教授的脑子里或一本教科书的某一页，它们在大脑和大脑的碰撞中，在问题和知识的交汇之处，在一线高手的实战之中。<br>要和知识源头联机。</strong></p>\n<h2 id=\"终身提问者：问题比答案更有效\">终身提问者：问题比答案更有效<a href=\"post/2019-9-22-yueqian#终身提问者：问题比答案更有效\"></a></h2><p>一开始我们靠兴趣，但是兴趣多变；然后我们追新知，发现新知进化得比我们学习的速度还快；之后我们回身去读经典，却发现经典一辈子也读不完；于是我们开始寻求底层逻辑。</p>\n<p>今天，真正串联一个又一个知识的，不是学科知识，而是场景问题。学海无涯，终身学习者很容易陷入为学习而学习的窘境。你需要一棵“问题树”。<br>和知识树不一样，问题树依托一个真实的、高价值，并有可能被解决的问题来展开。它包括4个方面：</p>\n<blockquote>\n<p>• 我们面临什么样的问题？<br>• 我们如何知道自己已经解决了这个问题？<br>• 我们会遇到哪些挑战和障碍？<br>• 我们有什么可能的解决方案？</p>\n</blockquote>\n<p>以上4个问题会出现很多关键词，指向各个领域，每个领域又会产生新的关键词，然后生长成一棵关于这个问题的“问题树”。</p>\n<p><strong>亚里士多德的知识树和“产品设计”、“公司运营”的问题树</strong><br>问题树创造知识体系的过程和网络搜索的方式一模一样。你在谷歌输入一个关键词，几毫秒内，电脑生成了一个页面。请注意，这个页面不是世界上“现存”的，而是为了你输入的这个关键词“生成”的。谷歌为你的提问“生成”了一套知识体系。你提出一个问题，就相当于在你的大脑的空白框里输入了这个关键词，从此，你过去的知识、人际网络、生活经验都和这个关键词连接起来，逐渐长成自己的问题树。</p>\n<p>人类的天性在认知上是吝啬的，很懒惰，学习和思考是一件非常耗能、反人性的事。所以，如果一个知识不能被用来解决问题，就不值得学习。<br>你需要的，是用来解决问题的知识。</p>\n<p>你要学什么？答案就在于你要解决什么样的问题。增强学习动力的最好方法是找到你真正感兴趣的问题。关于专注和多元的解释在这里也实现了和谐统一。<br>专注于你的问题，调用多元知识。在目标上专注，在手段上多元。<br>未来没有专业，真正的专业是你“特别擅长解决某类型的问题”，才不会管你调用了哪些学科。</p>\n<h3 id=\"提问的力量\">提问的力量<a href=\"post/2019-9-22-yueqian#提问的力量\"></a></h3><blockquote>\n<p>出一道题，考考你的记忆力：<br>有一辆车，车上有8个人；<br>第一站，上来了3个，下去了5个；<br>然后，上来了5个，下去了8个；<br>然后，上来了8个，下去了3个；<br>然后，上来了2个人，没有人下去；<br>然后，上来了4个人，下去了一半的人。<br>现在请问，车走了多少站？</p>\n</blockquote>\n<p>你可能会说我耍流氓，你为什么不早说？<br>这个游戏凸显出我们日常的一个困境——当信息多到你记不住的时候，你就会散焦，丢失真正的答案。唯一的解决方法就是提问。提问比答案更有效果。</p>\n<p>爱因斯坦说：“如果我必须用一小时解决一个重要问题，我会花55分钟考虑我是否问对了问题。”</p>\n<p><strong>提问式学习<br>提问即创造<br>提问会倒逼你更新知识、深入思考</strong></p>\n<p>基于问题的学习符合复利的两个条件：</p>\n<ol>\n<li>为了解决问题，昨天的思考和学到的知识会马上应用到今天的解决方案上去，形成迭代；</li>\n<li>如果一个知识有用，就不会被忘记；如果没用，忘记也不可惜。</li>\n</ol>\n<h3 id=\"比终身学习者更有效的，是终身提问者\">比终身学习者更有效的，是终身提问者<a href=\"post/2019-9-22-yueqian#比终身学习者更有效的，是终身提问者\"></a></h3><p>终身提问者的学习目标更清晰，更不会在知识树里迷路，问题就是他的明灯。<br>终身提问者的反馈更及时，问题就是他的试金石，他很清楚地知道哪些知识有用、哪些没用。<br>终身提问者的动力更强，因为他知道一个问题解锁以后，会带来更多、更大、更有趣的问题，但一切都要从解开这个问题开始，他孜孜不倦，又平静从容。<br>终身提问者更有号召力，一个足够好的问题，需要很多领域的人共同解决，那些平时没机会一起交流的人因为问题聚首。<br>你的问题有多多，你的知识就有多多。你的问题有多好，你的专业就有多好。<strong>人生就是一个个问题解惑的过程。</strong></p>\n<p>我对自己的员工有一个“百知谷”要求——一个问题，没看完百度、知乎和谷歌搜索前三页，不要浪费别人的时间去提问。</p>\n<h2 id=\"知识IPO：把知识变现成价值\">知识IPO：把知识变现成价值<a href=\"post/2019-9-22-yueqian#知识IPO：把知识变现成价值\"></a></h2><p>正如你不可能走完一座大山的所有角落，聪明的探险者懂得做个标记，下次再来，继续向终点进发。整个过程以解决问题为最高标准，持续问自己：“这个知识对于解决问题有用吗？”“如果有用，是当下就有用吗？”如果暂时没有用，做个记号收藏到你的笔记里，以后再看。一旦你能解决一个问题，就要尝试多解决同类型的问题，逐渐让这个解决方案能够应对不同情境，自我进化。</p>\n<p>高标准<br>输出倒逼输入（O）</p>\n<p><strong>大部分人欠缺的，是把解决问题的结果传播出去。一方面，写作能把这些知识形成体系，整理成能出手的“知识晶体”。更重要的是，这个过程能兑换价值，让更多人知道你有解决这类问题的能力。这个动作能帮你找到下一轮更大的问题，以及更大的价值，形成迭代。这个循环能持续放大，带来一轮又一轮的知识跃迁。</strong></p>\n<p>以前每个班上，都有一位爱抄笔记的小朋友，在考试前几天，他成为人见人爱的大明星。其实，每个社群都需要一个首席知识官。整理知识也是一种知识的重建。如果你并不擅长创作知识，尽心尽力地做好首席知识官也是非常了不起的。<br>你也许需要学习笔记、整理脑图、视觉引导，但是千万要记得<strong>让知识成为产品，不要成为自嗨的收藏品。</strong></p>\n<h2 id=\"系统：新手看树木，高手看森林\">系统：新手看树木，高手看森林<a href=\"post/2019-9-22-yueqian#系统：新手看树木，高手看森林\"></a></h2><p> 数千亿的资金投入非洲，并没有让非洲脱贫；因为贫困是一种政治和心智问题，援助往往让当地官员更加腐败奢华，钱发不到民众手中；即使少数到了穷人手中，他们也倾向于消费一轮，而不是改变困境；</p>\n<h2 id=\"回路：设计人生的增长引擎\">回路：设计人生的增长引擎<a href=\"post/2019-9-22-yueqian#回路：设计人生的增长引擎\"></a></h2><p>好的破局者往往知道：当一个体验短期很爽的时候，你往往要警惕：长远的损失是什么？而当这个体验短期痛苦的时候，你也需要自我激励：长远的收益会是什么？</p>\n<p>作为一名系统思考者，你能养成的最好的第一个思维习惯就是逆时间打断负循环：<br>• 如果忙得没空思考，那么没空思考是否让你更忙呢？<br>• 如果因为穷，所以总希望翻盘，那么总希望翻盘是否让你更穷呢？<br>• 看到人口带来贫困的报道时，你也一定要尝试思考，贫困是否也会带来人口增长呢？<br>一旦发现这些情况是首尾相连的，尽快打断这种恶性的负面循环。你可以通过直接打断、引入更多资源，或者搭建新的回路来实现。</p>\n<p>第二个思维习惯是顺着时间搭建正循环：<br>• 如果写作能为你带来名声，那么如何用名声帮你更好地创作？<br>• 如果技能精进能让你获得成功，那么如何用成功让你更加精进？<br>• 如果做某件事情能让你有所收益，那么如何让收益带来更多类似的事情？<br>第一个问题的答案就是第三章提到的知识IPO，第二个问题的思考结果是联机学习、“以答案换答案”的方式；第三种情况其实就是投资的本质，用赚来的钱继续投资。<br>一旦有了这个意识，你就开始成为一名系统思考者，你的人生开始搭建各种细小的正循环回路，而那些侵蚀你精力的负循环也会慢慢停止。</p>\n<h2 id=\"看世界：开放而专注\">看世界：开放而专注<a href=\"post/2019-9-22-yueqian#看世界：开放而专注\"></a></h2><p>高明与不高明的观点的差距并不在于智商，而是在于眼界。在今天，人与人在知识获得上是公平的，眼界的差距会反馈到心智上。这个决定因素，就是视野开放。</p>\n<p>“开放而专注”九律</p>\n<ol>\n<li>见得人好，经常随喜赞叹。</li>\n<li>找到自己领域的知识源头，并分享。</li>\n<li>不随便崇拜谁。一旦崇拜，以他为顶，你的系统就又封闭了。</li>\n<li>不再认为自己不喜欢、看不懂的东西就是傻的。</li>\n<li>小心那些“一切都能解释得通”的上帝视角感理论。</li>\n<li>对水平没你高的人要宽容，因为你也没有掌握真理。</li>\n<li>留出10%~30%的时间，给自己不懂也不太会接触的领域。</li>\n<li>站在更高角度，发现和专注于自己的独特之处。</li>\n<li>专注于自己的人生大问题。</li>\n</ol>\n<h2 id=\"看自己：迟钝而有趣\">看自己：迟钝而有趣<a href=\"post/2019-9-22-yueqian#看自己：迟钝而有趣\"></a></h2><p>“迟钝而有趣”七律</p>\n<ol>\n<li>对不重要的事，漠不关心。</li>\n<li>忍住第一反应，等待第二反应。</li>\n<li>不追热点，等要点浮现。</li>\n<li>寻求整体最优解，站在长周期做判断。</li>\n<li>多元，定期做点儿不靠谱、有趣无用的事。</li>\n<li>成功是小概率事件，找到自己的无限游戏。</li>\n<li>放下焦虑，不要放下好奇心。</li>\n</ol>\n<h3 id=\"层级：看问题很透彻的技术\">层级：看问题很透彻的技术<a href=\"post/2019-9-22-yueqian#层级：看问题很透彻的技术\"></a></h3><p>第一问（Emotion）：我在什么情绪之中？给自己的情绪打个几分？（找出情绪类别）</p>\n<p>第二问（Event）：发生了什么？尝试客观不带情绪地描述发生了什么事情。如果发现不能客观，还带有情绪化的语言，请返回第一层，继续处理自己的情绪。（挖掘情绪背后的事实）</p>\n<p>第三问（Target）：我原本想要什么？情绪一定是对自己的不满意，通过对情绪背后事实的描述，就可以发现产生情绪背后的初心——某种期望或目标未能达到。（找到期望目标差距）</p>\n<p>第四问（Action）：我如何改进？找到目标差距，就要正视自己，如何改变行动从而达到期望的目标。（行动改变）</p>\n<h2 id=\"ETA-——-教你如何无压高效地前进\">ETA —— 教你如何无压高效地前进<a href=\"post/2019-9-22-yueqian#ETA-——-教你如何无压高效地前进\"></a></h2><p>学习有瞬间理解的快感，而练习却反复暴露自己的智商。其实后者才是成长之路。<br>第一个E让你看到情绪。情绪是一个隐形的能量，当你清晰的描述他，就好像给隐身侠泼上墨水，他瞬间没了力量——当你面对和描述情绪，情绪自己消停了。<br>第二个E让你看到真相。很多时候，情绪撤去，真相就显露出来。<br>第三个T让你回到初心。很多时候我们忙于看事情的细节，忘记为什么出发了。<br>第四个A让你开始行动。聚焦未来，聚焦自己，聚焦能做的事情，才是重点。过去的、别人的、不能做的，统统管不着。</p>\n<ul>\n<li>贪：个人战略、年度计划，三件事。是帮助你戒贪的。你如果真的认真做过“算计要精”“结果心态”，精细画过年度目标的三环，你就应该知道每年能做好的事情到底有多少。</li>\n<li>嗔：ETA，许多对于人和事的愤怒，其实都源于你对于自己无能的愤怒。ETA让你看清自己的情绪和初心，然后行动。</li>\n<li>痴：生命之花谈的是平衡——你以为自己在“职业”方面的障碍，可能出在“家庭”上，可能出在“个人成长”上，当你看到了人生的全局，你不会死磕在一个角落。</li>\n</ul>\n","prev":{"title":"《TypeScript Deep Dive》（一）——English Learning Weekly","link":"post/2019-9-21-word"},"next":{"title":"English Learning Skills and How we do","link":"post/weekly-English-9-7"},"plink":"https://yanoo1497.github.io/post/2019-9-22-yueqian/","toc":[{"title":"走在时代前面的明白人","id":"走在时代前面的明白人","index":"1"},{"title":"外包大脑，成为超人","id":"外包大脑，成为超人","index":"2"},{"title":"头部效应：站位比努力更重要","id":"头部效应：站位比努力更重要","index":"3"},{"title":"功利学习法：学得更好，却学得更少","id":"功利学习法：学得更好，却学得更少","index":"4"},{"title":"联机学习者：成为知识的路由器","id":"联机学习者：成为知识的路由器","index":"5"},{"title":"终身提问者：问题比答案更有效","id":"终身提问者：问题比答案更有效","index":"6","children":[{"title":"提问的力量","id":"提问的力量","index":"6.1"},{"title":"比终身学习者更有效的，是终身提问者","id":"比终身学习者更有效的，是终身提问者","index":"6.2"}]},{"title":"知识IPO：把知识变现成价值","id":"知识IPO：把知识变现成价值","index":"7"},{"title":"系统：新手看树木，高手看森林","id":"系统：新手看树木，高手看森林","index":"8"},{"title":"回路：设计人生的增长引擎","id":"回路：设计人生的增长引擎","index":"9"},{"title":"看世界：开放而专注","id":"看世界：开放而专注","index":"10"},{"title":"看自己：迟钝而有趣","id":"看自己：迟钝而有趣","index":"11","children":[{"title":"层级：看问题很透彻的技术","id":"层级：看问题很透彻的技术","index":"11.1"}]},{"title":"ETA —— 教你如何无压高效地前进","id":"ETA-——-教你如何无压高效地前进","index":"12"}]}