{"title":"(How to Think in English to Improve Your English Speaking Skills)——English Learning Weekly","date":"2019-08-18T13:05:35.000Z","link":"post/weekly-English-8-18","comments":true,"tags":["weekly"],"categories":["weekly"],"updated":"2019-08-19T01:47:10.694Z","content":"<blockquote>\n<p>Video Link: <a href=\"https://www.youtube.com/watch?v=9PAt4-EZsFA&feature=youtu.be\" target=\"_blank\" rel=\"noopener\">How to Think in English to Improve Your English Speaking Skills</a></p>\n</blockquote>\n<p>This video is about some tips to think in English.Blow are those tips:</p>\n<ol>\n<li><p>Talk to yourself in English.<br>(1) You can do it when you’re brushing your teeth.Just notice anything you like and talk to yourself intentionally in English.<br>(2) You can do it on your way to work.Just talk about what you have to do that day is a good idea.<br>(3) Become a narrator.it means to tell a story about something.<br>(4) To choose a object in your room and spend one full minute describing that object.This will really help you with your fluency,and the next time you see that object,you will automattically begin to think in English,and that’s really important.</p>\n</li>\n<li><p>Don’t use bilingual dictionary.because when you use a monolingual dictionary,you prevent yourself from translating things word for word.And if you meet some new words,look it up instead in an English-only dirtionary is more helpful.Because you’ll learn so many words as you read the definition and you’ll also learn so many new words that are similar to the one you’re looking for.</p>\n</li>\n<li><p>Try to describe the word you don’t know</p>\n</li>\n<li><p>To keep a diary and to keep a to-do list.It gives us an opportunity to use the new vocabulary and new sentence structure,and it will helps our brain to remenber it.</p>\n</li>\n<li><p>Create a mantra in English,it will help you to turn your brain to an English.</p>\n</li>\n</ol>\n","prev":{"title":"How I Learn Things Online (Way More Efficiently)——English Learning Weekly","link":"post/post"},"next":{"title":"(The secrets of learning a new language)——English Learning Weekly","link":"post/weekly-English-8-11"},"plink":"https://yanoo1497.github.io/post/weekly-English-8-18/"}