{"title":"每周学习","date":"2019-08-18T13:05:35.000Z","link":"post/weekly-English-8-10","tags":["weekly"],"categories":["weekly"],"updated":"2019-08-18T14:24:46.875Z","content":"<h2 id=\"英语学习\">英语学习<a href=\"post/weekly-English-8-10#英语学习\"></a></h2><p>视频链接：<a href=\"https://www.youtube.com/watch?v=9PAt4-EZsFA&feature=youtu.be\" target=\"_blank\" rel=\"noopener\">How to Think in English to Improve Your English Speaking Skills\n</a><br>This vedio is about some tips to think in English.The author think that if you can think in English, you can communicate without translating.</p>\n<ul>\n<li><p>First:<br>To get comfortable talking to yourself.Just started to talk to yourself,don’t pay much attention to the correct to your description.</p>\n<ol>\n<li>You can do it when you’re brushing your teeth.Just notice your face,notice your hair,notice anything you like and talk to yourself intentionally in English.</li>\n<li>You can do it on your way to work.Just talk about what you have to do that day is a good idea.</li>\n<li>become a narrator.it means to tell a story about something.</li>\n<li>to choose o object in your room and spend one full minute describing that object.This will really help you with your fluency,and the next time you see that object,you will automattically begin to think in English,and that’s really important.</li>\n</ol>\n</li>\n<li><p>Second:<br>To get rid of your bilingual dictionary,to throw it out.because when you use a monolingual dictionary,you prevent yourself from translating things word for word.And if you meet some new words,look it up instead in an English-only dirtionary is more helpful.Because you’ll learn so many words as you read the definition and you’ll also learn so many new words that are similar to the one you’re looking for.</p>\n</li>\n<li><p>Third:<br>If you are in an conversation and you don’t know a word,instead to stoping to look the word up,describe the word instead.</p>\n</li>\n<li><p>Fourth<br>To keep a diary and to keep a to-do list.It gives us an opportunity to use the new vocabulary and new sentence structure,and it will helps our brain to remenber it.</p>\n</li>\n<li><p>Fifth<br>Create a mantra in English,it will automatically turn your brain to an English.</p>\n</li>\n</ul>\n","next":{"title":"每周学习","link":"post/weekly-English-8-18"},"plink":"https://yanoo1497.github.io/post/weekly-English-8-10/","toc":[{"title":"英语学习","id":"英语学习","index":"1"}]}